---
kind: other
id: Methods.T:Autodesk.Revit.DB.CADLinkOperations
source: html/a2a3cef3-f940-fc40-bfe9-21fb12b25801.htm
---
# CADLinkOperations Methods

Sets the callback that will be called when the Revit user saves new shared coordinate
 settings to a linked document obtained from an IExternalResourceServer.